[
    {
        "text": "Alex told me that they prefer working from home because it gives them more flexibility with their schedule.",
        "clusters": [["Alex", "they", "them", "their"]]
    },
    {
        "text": "When Jordan arrives at the office, they usually check their email first, then they organize their tasks for the day.",
        "clusters": [["Jordan", "they", "their", "they", "their"]]
    },
    {
        "text": "Sam mentioned that they forgot their lunch today, so they will need to buy something from the cafeteria.",
        "clusters": [["Sam", "they", "their", "they"]]
    },
    {
        "text": "Riley explained that they need help with their math homework because they find calculus challenging.",
        "clusters": [["Riley", "they", "their", "they"]]
    },
    {
        "text": "Casey joined our team last month, and they have already shared their innovative ideas with everyone.",
        "clusters": [["Casey", "they", "their"]]
    },
    {
        "text": "Morgan loves cooking, especially when they can experiment with their grandmother's recipes in their kitchen.",
        "clusters": [["Morgan", "they", "their", "their"]]
    },
    {
        "text": "Taylor is very creative, and they spend most of their free time designing websites for their clients.",
        "clusters": [["Taylor", "they", "their", "their"]]
    },
    {
        "text": "Avery studies biology because they want to become a doctor, and they believe their research can help people.",
        "clusters": [["Avery", "they", "they", "their"]]
    },
    {
        "text": "Quinn loves reading so much that they finish two books per week, often staying up late with their favorite novels.",
        "clusters": [["Quinn", "they", "their"]]
    },
    {
        "text": "Devon plays soccer every afternoon because they want to improve their skills before their next tournament.",
        "clusters": [["Devon", "they", "their", "their"]]
    },
    {
        "text": "Parker is an artist who paints with watercolors, and they spend hours perfecting their technique because their work needs to capture emotion.",
        "clusters": [["Parker", "they", "their", "their"]]
    },
    {
        "text": "Sage works remotely from their home office, and they really enjoy the flexibility it gives them in managing their daily schedule.",
        "clusters": [["Sage", "their", "they", "them", "their"]]
    },
    {
        "text": "Drew loves photography so much that they travel everywhere with their camera to capture stunning images for their growing portfolio.",
        "clusters": [["Drew", "they", "their", "their"]]
    },
    {
        "text": "Phoenix studies astronomy and they use telescopes nightly because their research focuses on discovering new star formations in distant galaxies.",
        "clusters": [["Phoenix", "they", "their"]]
    },
    {
        "text": "Rowan teaches kindergarten and they absolutely love working with kids, especially when they can make their classroom a colorful, engaging space.",
        "clusters": [["Rowan", "they", "they", "their"]]
    },
    {
        "text": "Emery is a chef who creates innovative recipes for their restaurant, and they take pride in how popular their establishment has become.",
        "clusters": [["Emery", "their", "they", "their"]]
    },
    {
        "text": "Finley writes novels and they manage to publish new books yearly because their captivating stories always find an eager audience.",
        "clusters": [["Finley", "they", "their"]]
    },
    {
        "text": "Blake runs marathons and they train every morning before work, showing their incredible dedication to the sport they love.",
        "clusters": [["Blake", "they", "their", "they"]]
    },
    {
        "text": "Reese plays violin in several orchestras, and they have developed their technique to such a flawless level that audiences always applaud enthusiastically.",
        "clusters": [["Reese", "they", "their"]]
    },
    {
        "text": "Hayden builds robots in their workshop, and they spend months designing mechanical systems because their inventions need to be both clever and reliable.",
        "clusters": [["Hayden", "their", "they", "their"]]
    },
    {
        "text": "River studies marine biology and they regularly dive with sharks to conduct their important research that protects ocean ecosystems.",
        "clusters": [["River", "they", "their"]]
    },
    {
        "text": "Cameron codes software for mobile apps, and they take great pride in ensuring their programs are both efficient and user-friendly.",
        "clusters": [["Cameron", "they", "their"]]
    },
    {
        "text": "When Skyler arrives at the office, they usually bring coffee for everyone because they know their thoughtfulness makes the whole team happy.",
        "clusters": [["Skyler", "they", "they", "their"]]
    },
    {
        "text": "My colleague Remy is brilliant. They solve complex problems quickly, and their insights help everyone.",
        "clusters": [["My colleague", "Remy", "They", "their"]]
    },
    {
        "text": "I know someone named Kai who teaches yoga. They have been practicing for years and their classes are popular.",
        "clusters": [["Kai", "They", "their"]]
    },
    {
        "text": "The new employee, Ash, starts Monday. They will work remotely, so their schedule is flexible.",
        "clusters": [["The new employee", "Ash", "They", "their"]]
    },
    {
        "text": "My friend Harper loves traveling. They visit new countries yearly, and their photos are stunning.",
        "clusters": [["My friend", "Harper", "They", "their"]]
    },
    {
        "text": "There's a student named Robin in my class. They ask great questions, and their essays are well-written.",
        "clusters": [["a student named Robin", "Robin", "They", "their"]]
    },
    {
        "text": "The artist, Sage, exhibits paintings downtown. They use mixed media, and their style is unique.",
        "clusters": [["The artist", "Sage", "They", "their"]]
    },
    {
        "text": "A person named Jamie works here. They handle customer service, and their patience is remarkable.",
        "clusters": [["Jamie", "They", "their"]]
    },
    {
        "text": "My neighbor Ellis gardens organically. They grow vegetables year-round, and their tomatoes are delicious.",
        "clusters": [["My neighbor", "Ellis", "They", "their"]]
    },
    {
        "text": "The musician, Quinn, performs at local venues. They play acoustic guitar, and their voice is beautiful.",
        "clusters": [["The musician", "Quinn", "They", "their"]]
    },
    {
        "text": "At the conference, Dr. Patel presented groundbreaking research. They had spent years developing this methodology, and their findings revolutionized the field completely.",
        "clusters": [["Dr. Patel", "They", "their"]]
    },
    {
        "text": "Sam quit their job yesterday because they wanted more creative freedom.",
        "clusters": [["Sam", "their", "they"]]
    },
    {
        "text": "The detective, Riley Chen, solved the case through careful investigation. When they examined the evidence, their analytical skills became apparent.",
        "clusters": [["The detective", "Riley Chen", "they", "their"]]
    },
    {
        "text": "Have you met Jordan? They're incredibly talented at problem-solving and their approach is always innovative.",
        "clusters": [["Jordan", "They", "their"]]
    },
    {
        "text": "My therapist helped me understand anxiety better. They explained that everyone processes emotions differently, and their guidance was invaluable.",
        "clusters": [["My therapist", "They", "their"]]
    },
    {
        "text": "Taylor's presentation went well yesterday. They answered questions confidently, though some of their slides needed more detail.",
        "clusters": [["Taylor", "They", "their"]]
    },
    {
        "text": "The barista at the corner cafe knows my order by heart. They always smile warmly, and their coffee art is beautiful.",
        "clusters": [["The barista", "The barista at the corner cafe", "They", "their"]]
    },
    {
        "text": "When Alex starts their new position next month, they'll be managing a team of twelve people.",
        "clusters": [["Alex", "their", "they"]]
    },
    {
        "text": "The librarian recommended several books about climate change. They mentioned that their personal favorite deals with renewable energy solutions.",
        "clusters": [["The librarian", "They", "their"]]
    },
    {
        "text": "Morgan's parents are incredibly proud of them because they recently graduated summa cum laude, and their thesis on urban planning won a prestigious award.",
        "clusters": [["Morgan", "them", "they", "their"]]
    },
    {
        "text": "Every Tuesday, Cameron volunteers at the animal shelter. They find it rewarding work, and their dedication helps many animals find homes.",
        "clusters": [["Cameron", "They", "their"]]
    },
    {
        "text": "The chef at this restaurant is phenomenal. They source ingredients locally, and their seasonal menu changes monthly.",
        "clusters": [["The chef", "They", "their"]]
    },
    {
        "text": "Avery's research focuses on marine ecosystems. They dive in coral reefs regularly, documenting how their health affects fish populations.",
        "clusters": [["Avery", "They", "their"]]
    },
    {
        "text": "The contractor promised to finish the renovation by Friday. They've been working diligently, but their timeline seems optimistic.",
        "clusters": [["The contractor", "They", "their"]]
    },
    {
        "text": "Quinn teaches advanced mathematics at the university. They use interactive methods in their lectures, making complex concepts accessible to students.",
        "clusters": [["Quinn", "They", "their"]]
    },
    {
        "text": "The nurse was exceptionally kind during my stay. They checked on patients frequently, and their compassion made recovery easier.",
        "clusters": [["The nurse", "They", "their"]]
    },
    {
        "text": "Devon's artwork was featured in three galleries this year. They work primarily with mixed media, and their pieces explore themes of identity.",
        "clusters": [["Devon", "They", "their"]]
    },
    {
        "text": "My neighbor Parker grows an incredible garden. They compost all their kitchen scraps and share vegetables with everyone on the block.",
        "clusters": [["My neighbor Parker", "Parker", "They", "their"]]
    },
    {
        "text": "The mechanic diagnosed the problem quickly. They explained that the transmission needed replacement, and their estimate was reasonable.",
        "clusters": [["The mechanic", "They", "their"]]
    },
    {
        "text": "Sage writes poetry that captures human emotions beautifully. They perform at open mic nights, and their words resonate with diverse audiences.",
        "clusters": [["Sage", "They", "their"]]
    },
    {
        "text": "The software engineer debugged the entire system overnight. They identified the root cause efficiently, and their solution prevented future crashes.",
        "clusters": [["The software engineer", "They", "their"]]
    },
    {
        "text": "Drew's documentary about climate refugees premiered last week. They interviewed subjects across three continents, and their storytelling brings important issues to light.",
        "clusters": [["Drew", "They", "their"]]
    },
    {
        "text": "The postal worker delivers mail to our neighborhood cheerfully every day. They remember everyone's names, and their positive attitude brightens our mornings.",
        "clusters": [["The postal worker", "They", "their"]]
    },
    {
        "text": "Finley started their own consulting business after leaving corporate America. They specialize in organizational psychology, and their clients include Fortune 500 companies.",
        "clusters": [["Finley", "their", "They", "their"]]
    },
    {
        "text": "The physical therapist helped me recover from injury. They designed a personalized exercise program, and their expertise accelerated my healing process.",
        "clusters": [["The physical therapist", "They", "their"]]
    },
    {
        "text": "River coordinates disaster relief efforts internationally. They've managed operations in twelve countries, and their leadership saves lives during crises.",
        "clusters": [["River", "They", "their"]]
    },
    {
        "text": "The architect designed sustainable buildings throughout the city. They incorporate renewable energy systems, and their projects reduce environmental impact significantly.",
        "clusters": [["The architect", "They", "their"]]
    },
    {
        "text": "Hayden's research on artificial intelligence ethics was groundbreaking. They published papers in top-tier journals, and their work influences policy development globally.",
        "clusters": [["Hayden", "They", "their"]]
    },
    {
        "text": "The firefighter rescued three families from the burning apartment building. They showed incredible courage, and their quick thinking prevented a tragedy.",
        "clusters": [["The firefighter", "They", "their"]]
    },
    {
        "text": "Reese performs with the symphony orchestra regularly. They play first violin beautifully, and their solos often receive standing ovations.",
        "clusters": [["Reese", "They", "their"]]
    },
    {
        "text": "The pediatrician has excellent bedside manner with children. They make visits less scary for kids, and their patience with worried parents is remarkable.",
        "clusters": [["The pediatrician", "They", "their"]]
    },
    {
        "text": "Blake founded a nonprofit organization that builds schools in underserved communities. They've established forty-three schools so far, and their impact transforms entire villages.",
        "clusters": [["Blake", "They", "their"]]
    },
    {
        "text": "The journalist investigated corruption within local government for months. They interviewed dozens of sources carefully, and their exposé led to significant reforms.",
        "clusters": [["The journalist", "They", "their"]]
    },
    {
        "text": "Casey's startup develops educational technology for dyslexic students. They understand learning differences personally, and their software helps thousands of children succeed academically.",
        "clusters": [["Casey", "They", "their"]]
    },
    {
        "text": "The veterinarian treated my cat with exceptional care. They explained the treatment options thoroughly, and their gentle approach calmed both pet and owner.",
        "clusters": [["The veterinarian", "They", "their"]]
    },
    {
        "text": "Jordan's food truck serves authentic Korean fusion cuisine. They learned recipes from their grandmother, and their bulgogi tacos are legendary throughout the city.",
        "clusters": [["Jordan", "They", "their", "their"]]
    },
    {
        "text": "The social worker advocates tirelessly for vulnerable children. They navigate complex bureaucracy effectively, and their dedication ensures kids find safe, loving homes.",
        "clusters": [["The social worker", "They", "their"]]
    },
    {
        "text": "Phoenix teaches wilderness survival skills to outdoor enthusiasts. They lead expeditions in remote locations, and their expertise has prevented numerous emergencies.",
        "clusters": [["Phoenix", "They", "their"]]
    },
    {
        "text": "The orthodontist made the braces process much easier than expected. They used the latest technology, and their friendly staff created a welcoming environment.",
        "clusters": [["The orthodontist", "They", "their"]]
    },
    {
        "text": "Rowan's community garden project brings neighbors together. They organize workshops on organic farming, and their vision transforms vacant lots into productive spaces.",
        "clusters": [["Rowan", "They", "their"]]
    }
]
